# Pandas Column Wise Operations

In [78]:
import pandas as pd
import numpy as np

# Load Json Dataset

In [79]:
df = pd.read_json('dataset/data.json', orient='columns')
df.head()
df.tail()

      name  Age Blood_Group  Nationality
9   Mehedi   32          B+  Bangladeshi
10   Momin   22          A+  Bangladeshi
11  Farsan   29          O+  Bangladeshi
12   Fatin   26         AB+  Bangladeshi
13  Shakil   26          B+  Bangladeshi

# Column Selection

In [80]:
# Select 1st column
df['name']
type(df['name'])

# select multiple column
df[['name','Age']].head()

     name  Age
0  Sharif   26
1   Imran   25
2    Akib   24
3   Hanif   26
4   Irfan   32

# Row Selection

In [81]:
# Select any single Row
df.iloc[0]

df.head(3)  # to select 1st 3 rows

df.tail(3)  # to select last 3 rows

# Select any number of Rows Using list slicing operation
df[2:5]

    name  Age Blood_Group  Nationality
2   Akib   24         AB+  Bangladeshi
3  Hanif   26          A+  Bangladeshi
4  Irfan   32          A+  Bangladeshi

# Select Through Conditions

In [82]:
df[ df['Age']> 30 ]   # select All rows where age>30

df[ df['Blood_Group']=='AB+']   # select All rows where Blood Group is 'AB+'

     name  Age Blood_Group  Nationality
2    Akib   24         AB+  Bangladeshi
5   Akash   36         AB+  Bangladeshi
12  Fatin   26         AB+  Bangladeshi

# Insert Column

In [86]:
#insert a new column at last
two_times_age = df['Age']*2
df['Two Times Age'] = two_times_age
df.head()

# Insert a new column at specific index/location
try:
    df.insert(3, "Three Times Age", df["Age"]*3)
except:
    pass
df.head()

     name  Age Blood_Group  Three Times Age  Nationality  Two Times Age
0  Sharif   26          B+               78  Bangladeshi             52
1   Imran   25          B+               75  Bangladeshi             50
2    Akib   24         AB+               72  Bangladeshi             48
3   Hanif   26          A+               78  Bangladeshi             52
4   Irfan   32          A+               96  Bangladeshi             64